Джира/src/Catalogs/Центр_СтатусыЗадач/Центр_СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Центр_СтатусыЗадач</name>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Новый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветHEX</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветRGB</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаRGB</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Джира/src/Catalogs/Центр_СтатусыЗадач/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
//@skip-check module-unused-method
//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ЦветОчистка(Элемент, СтандартнаяОбработка)
	Элементы.Цвет.ЦветФона = Новый Цвет();
КонецПроцедуры

//@skip-check module-structure-form-event-regions
//@skip-check module-unused-method
&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

//@skip-check module-structure-form-event-regions
//@skip-check module-unused-method
&НаКлиенте
Процедура ЦветПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    ОткрытьФормуВыбораЦвета("ЦветHEX", "ЦветRGB", "ЦветТекстаRGB"); 

КонецПроцедуры

//@skip-check module-structure-form-event-regions
//@skip-check doc-comment-parameter-section
&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормыВыбораЦвета(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ВыбранноеЗначение) ИЛИ ВыбранноеЗначение = КодВозвратаДиалога.Отмена Тогда
		Возврат;	
	КонецЕсли; 	
	
	//Модифицированность = Истина;      
	
	///////////////////////////// Цвет фона/текста в HEX	
	ИмяРеквизитаЦветаHEX 			= ДополнительныеПараметры.ИмяРеквизитаЦветаHEX;
	Объект[ИмяРеквизитаЦветаHEX] 	= ВыбранноеЗначение.ЦветHEX;         
	
	///////////////////////////// Цвет фона/текста в RGB (для фона элемента формы)
	
	//@skip-check new-color
	ЦветФона = Новый Цвет(ВыбранноеЗначение.ЦветRGB.R, ВыбранноеЗначение.ЦветRGB.G, ВыбранноеЗначение.ЦветRGB.B);  
	
	Элементы.ФормаВыбратьЦвет.ЦветФона = ЦветФона;
		                      
	МассивЧастейЦвета = Новый Массив;
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветRGB.R);
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветRGB.G);
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветRGB.B); 
	
	Объект[ДополнительныеПараметры.ИмяРеквизитаЦветаRGB] = СтрСоединить(МассивЧастейЦвета, ",");
	
	МассивЧастейЦвета = Новый Массив;
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветТекстаRGB.R);
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветТекстаRGB.G);
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветТекстаRGB.B);  
	
	Объект[ДополнительныеПараметры.ИмяРеквизитаЦветаТекстаRGB] = СтрСоединить(МассивЧастейЦвета, ",");
	
	//@skip-check new-color
	ЦветТекста = Новый Цвет(ВыбранноеЗначение.ЦветТекстаRGB.R, ВыбранноеЗначение.ЦветТекстаRGB.G, ВыбранноеЗначение.ЦветТекстаRGB.B);  
	
	Элементы.ФормаВыбратьЦвет.ЦветТекста = ЦветТекста;
	//ЦветКрасный = ВыбранноеЗначение.ЦветТекстаRGB.R;
	//ЦветЗеленый = ВыбранноеЗначение.ЦветТекстаRGB.G;
	//ЦветСиний = ВыбранноеЗначение.ЦветТекстаRGB.B;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если ЗначениеЗаполнено(Объект.ЦветRGB) тогда
		Фон = СтрРазделить(Объект.ЦветRGB,",");	
		//@skip-check new-color
		Элементы.ФормаВыбратьЦвет.ЦветФона = Новый Цвет(Фон[0],Фон[1],Фон[2]);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЦветТекстаRGB) тогда
		ЦветТекста = СтрРазделить(Объект.ЦветТекстаRGB,",");	
		//@skip-check new-color
		Элементы.ФормаВыбратьЦвет.ЦветТекста = Новый Цвет(ЦветТекста[0],ЦветТекста[1],ЦветТекста[2]);	
	КонецЕсли; 		
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ЗакрытПриИзменении(Элемент)
	Если Объект.Закрыт Тогда
		Объект.Новый = Ложь;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовыйПриИзменении(Элемент)
	Если Объект.Новый Тогда
		Объект.Закрыт = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыбратьЦвет(Команда)
    ОткрытьФормуВыбораЦвета("ЦветHEX", "ЦветRGB", "ЦветТекстаRGB"); 
КонецПроцедуры
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОткрытьФормуВыбораЦвета(ИмяРеквизитаЦветаHEX, ИмяРеквизитаЦветаRGB = "", ИмяРеквизитаЦветаТекстаRGB = "")

	ОткрытьФорму("ОбщаяФорма.Центр_ФормаВыбораЦвета", 
		Новый Структура("Цвет", Объект[ИмяРеквизитаЦветаHEX]), 
		ЭтотОбъект,,,, 
		Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыВыбораЦвета", ЭтотОбъект, 
			Новый Структура("ИмяРеквизитаЦветаHEX, ИмяРеквизитаЦветаRGB, ИмяРеквизитаЦветаТекстаRGB", 
				ИмяРеквизитаЦветаHEX, ИмяРеквизитаЦветаRGB, ИмяРеквизитаЦветаТекстаRGB
			)
		)
	); 
	
	
КонецПроцедуры
#КонецОбласти
